# Дано число. Если оно положительно выведите yes, иначе no.

n = int(input())
if n > 0:
    print('yes')
else:
    print('no')