# Даны два числа, если они равны, выведите yes, иначе - no

n1 = int(input())
n2 = int(input())
if n1 == n2:
    print('yes')
else:
    print('no')