# Даны два числа, вывести на экран максимальное их них

n1 = int(input())
n2 = int(input())
if n1 > n2:
    print(n1)
else:
    print(n2)