# Напишите функцию my_sum, которая принимает два числа и возвращает их сумму.
# Проверьте корректность её работы при разных значениях аргументов. Например my_sum(1, 2), my_sum(25, 75) и т.д.

def my_sum(a, b):
    print(a + b)


my_sum(5, 100)

